In [ ]:
#load sqlite3
import sqlite3

In [2]:
# Connecting to sqlite
# connection object
conn = sqlite3.connect('INSTRUCTOR.db')

In [3]:
# cursor object
cursor_obj = conn.cursor()

In [4]:
#Before creating a table, let's first check if the table already exists or not. To drop the table from a database, use the DROP query. A cursor is an object that helps execute the query and fetch the records from the database.

cursor_obj.execute("DROP TABLE IF EXISTS INSTRUCTOR")

In [5]:
# Creating table
table = "CREATE TABLE IF NOT EXISTS INSTRUCTOR(ID INTEGER PRIMARY KEY NOT NULL, FNAME VARCHAR(20), LNAME VARCHAR(20), CITY VARCHAR(20), CCODE CHAR(2))"

cursor_obj.execute(table)
print("table is ready")

table is ready

In [6]:
cursor_obj.execute("INSERT INTO INSTRUCTOR VALUES (1, 'Rav', 'Ahuja', 'TORONTO', 'CA')")

In [7]:
cursor_obj.execute('''insert into INSTRUCTOR values (2, 'Raul', 'Chong', 'Markham', 'CA'), (3, 'Hima', 'Vasudevan', 'Chicago', 'US')''')

# Query data in the table

In [8]:
statement = "SELECT * FROM INSTRUCTOR"

cursor_obj.execute(statement)

print("all the data")
output = cursor_obj.fetchall()

for row in output:
    print(row)

all the data
(1, 'Rav', 'Ahuja', 'TORONTO', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')
(3, 'Hima', 'Vasudevan', 'Chicago', 'US')

In [9]:
## Fetch few rows from the table

statement = "SELECT * FROM INSTRUCTOR"

cursor_obj.execute(statement)

output = cursor_obj.fetchmany(2)
for row in output:
    print(row)

(1, 'Rav', 'Ahuja', 'TORONTO', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')

In [11]:
# Fetch only FNAME from the table

statement = "SELECT FNAME FROM INSTRUCTOR"

cursor_obj.execute(statement)

output = cursor_obj.fetchall()

for row in output:
    print(row)

('Rav',)
('Raul',)
('Hima',)

In [15]:
#execute an update statement that changes the Rav's CITY to MOOSETOWN
query_update = 'UPDATE INSTRUCTOR SET CITY= "Moosetown" WHERE FNAME="Rav"'
cursor_obj.execute(query_update)

statement = 'SELECT * FROM INSTRUCTOR'
cursor_obj.execute(statement)
output1= cursor_obj.fetchall()

for row in output1:
    print(row)

(1, 'Rav', 'Ahuja', 'Moosetown', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')
(3, 'Hima', 'Vasudevan', 'Chicago', 'US')

# Retrieve data into Pandas

In [16]:
import pandas as pd
df= pd.read_sql_query("SELECT * FROM INSTRUCTOR", conn)
df

   ID FNAME      LNAME       CITY CCODE
0   1   Rav      Ahuja  Moosetown    CA
1   2  Raul      Chong    Markham    CA
2   3  Hima  Vasudevan    Chicago    US

In [17]:
df.LNAME[0]

'Ahuja'

In [18]:
df.shape

(3, 5)

In [19]:
conn.close()